nc: 58

backbone:
  - [-1, 1, UIBDown, [32, 3, 2, 6.0]]
  - [-1, 1, UIBDown, [64, 3, 2, 6.0]]
  - [-1, 1, UIB,     [64, 3, 1, 6.0]]
  - [-1, 1, UIB,     [64, 3, 1, 6.0]]

  - [-1, 1, UIBDown, [128, 3, 2, 6.0]]
  - [-1, 1, UIB,     [128, 3, 1, 6.0]]
  - [-1, 1, UIB,     [128, 3, 1, 6.0]]

  - [-1, 1, UIBDown, [256, 3, 2, 6.0]]
  - [-1, 1, UIB,     [256, 3, 1, 6.0]]
  - [-1, 1, UIB,     [256, 3, 1, 6.0]]

  - [-1, 1, UIBDown, [512, 3, 2, 6.0]]
  - [-1, 1, UIB,     [512, 3, 1, 6.0]]
  - [-1, 1, UIB,     [512, 3, 1, 6.0]]
  - [-1, 1, SPPF,    [512, 5]]
  - [-1, 2, C2PSA,   [512]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [64, False]]

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[23, 26, 29, 32], 1, Detect, [nc]]